In [171]:
import pandas as pd

#### 1. Create dataframe

In [172]:
company_data = {'CompanyName': ["VW","Acura","Honda", "Honda" ] ,
'Categoricalvalue': [1, 2, 3, 3],
'Price':  [20000, 10011, 50000,10000 ]}

categorical_company = pd.DataFrame(company_data)
categorical_company

  CompanyName  Categoricalvalue  Price
0          VW                 1  20000
1       Acura                 2  10011
2       Honda                 3  50000
3       Honda                 3  10000

#### 2. Create dummies - Panda

In [173]:
mapping = pd.get_dummies(categorical_company)
mapping

,Categoricalvalue,Price,CompanyName_Acura,CompanyName_Honda,CompanyName_VW
0,1,20000,0,0,1
1,2,10011,1,0,0
2,3,50000,0,1,0
3,3,10000,0,1,0

### 3. Create dummies - Sklearn

In [174]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
enc = OneHotEncoder()

#### 3.1 Create columns dummies

In [175]:
categorical_company['CompanyName_encoded'] = le.fit_transform(categorical_company["CompanyName"])
categorical_company

  CompanyName  Categoricalvalue  Price  CompanyName_encoded
0          VW                 1  20000                    2
1       Acura                 2  10011                    0
2       Honda                 3  50000                    1
3       Honda                 3  10000                    1

In [176]:
X = enc.fit_transform(categorical_company["CompanyName_encoded"].values.reshape(-1,1)).toarray()
X

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [0., 1., 0.]])

#### 3.2 Create Dummies Column name

In [177]:
dummy_columns=["CompanyName_"+str(i) for i in list(le.classes_)]
dummy_columns

['CompanyName_Acura', 'CompanyName_Honda', 'CompanyName_VW']

#### 3.3 Add columns dummies

In [178]:
dfOneHot = pd.DataFrame(X, columns =dummy_columns)
categorical_company = pd.concat([categorical_company, dfOneHot], axis=1)
categorical_company

,CompanyName,Categoricalvalue,Price,CompanyName_encoded,CompanyName_Acura,CompanyName_Honda,CompanyName_VW
0,VW,1,20000,2,0.0,0.0,1.0
1,Acura,2,10011,0,1.0,0.0,0.0
2,Honda,3,50000,1,0.0,1.0,0.0
3,Honda,3,10000,1,0.0,1.0,0.0

### 4. Encoder example

In [179]:
le = LabelEncoder()
le.fit(["paris", "paris", "tokyo", "amsterdam"])
LabelEncoder()
list(le.classes_)

['amsterdam', 'paris', 'tokyo']

In [180]:
transform=le.transform(["tokyo", "tokyo", "paris"]) 
transform

array([2, 2, 1], dtype=int64)

In [181]:
list(le.inverse_transform(transform))

D:\ProgramData\lib\site-packages\sklearn\preprocessing\label.py:151: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if diff:

['tokyo', 'tokyo', 'paris']